In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('salaries.csv')

In [3]:
df.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [4]:
from sklearn.preprocessing import LabelEncoder

In [5]:
le = LabelEncoder()

In [8]:
df['company_1'] = le.fit_transform(df['company'])
df['job_1'] = le.fit_transform(df['job'])
df['degree_1'] = le.fit_transform(df['degree'])

In [9]:
df = df.drop(['company','job','degree'],axis=1)

In [10]:
df.head(4)

   salary_more_then_100k  company_1  job_1  degree_1
0                      0          2      2         0
1                      0          2      2         1
2                      1          2      0         0
3                      1          2      0         1

In [11]:
from sklearn import tree

In [12]:
model = tree.DecisionTreeClassifier()

In [13]:
X = df.drop('salary_more_then_100k',axis=1)
X

    company_1  job_1  degree_1
0           2      2         0
1           2      2         1
2           2      0         0
3           2      0         1
4           2      1         0
5           2      1         1
6           0      2         1
7           0      1         0
8           0      0         0
9           0      0         1
10          1      2         0
11          1      2         1
12          1      0         0
13          1      0         1
14          1      1         0
15          1      1         1

In [14]:
Y = df['salary_more_then_100k']

In [15]:
model.fit(X,Y)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [17]:
model.predict(X)

array([0, 0, 1, 1, 0, 1, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1])

In [18]:
Y

0     0
1     0
2     1
3     1
4     0
5     1
6     0
7     0
8     0
9     1
10    1
11    1
12    1
13    1
14    1
15    1
Name: salary_more_then_100k, dtype: int64

In [19]:
model.score(X,Y)

1.0